## Pandas
### pandas use cases
#### Data Tersformation
#### Data Analysis
#### Data Cleaning
### Pandas Notations:
#### series---------creating the data
#### DataFrame------for making the data in a particular tabular formate

In [1]:
import pandas as pd
internal1={'s1':30,'s2':34,'s3':20}
internal1=pd.Series(internal1)

In [2]:
print(internal1)

s1    30
s2    34
s3    20
dtype: int64

In [4]:
internal1={'s1':30,'s2':34,'s3':20}
internal1=pd.Series(internal1)
print(internal1)
internal2={'s1':40,'s2':30,'s3':28}
internal2=pd.Series(internal2)

print(internal2)

s1    30
s2    34
s3    20
dtype: int64
s1    40
s2    30
s3    28
dtype: int64

In [5]:
final={'INTERNAL1':internal1,'INTERNAL2':internal2}
final=pd.DataFrame(final)
final

    INTERNAL1  INTERNAL2
s1         30         40
s2         34         30
s3         20         28

In [6]:

## display student marks using Pands

#    student names with regno 

name={'406':'gandhi','407':'ram','408':'sita','411':'sagar'}
name=pd.Series(name)

#    engilsh marks of the student

english={'406':30,'407':40,'408':50,'411':35}
english=pd.Series(english)

#    maths marks of the student

maths={'406':45,'407':34,'408':45,'411':50}
maths=pd.Series(maths)

#     final result (combining name,english marks and maths marks)

final={'NAME':name,'ENGLISH':english,'MATHS':maths}
final=pd.DataFrame(final)
final

       NAME  ENGLISH  MATHS
406  gandhi       30     45
407     ram       40     34
408    sita       50     45
411   sagar       35     50

In [7]:

final.columns

Index(['NAME', 'ENGLISH', 'MATHS'], dtype='object')

In [8]:


final.values

array([['gandhi', 30, 45],
       ['ram', 40, 34],
       ['sita', 50, 45],
       ['sagar', 35, 50]], dtype=object)

In [9]:


final.values[2]

array(['sita', 50, 45], dtype=object)

In [10]:


final.values[2][0]

'sita'

In [11]:
for i in final.values:
    print(i[0],i[1],i[2])

gandhi 30 45
ram 40 34
sita 50 45
sagar 35 50

In [12]:


final.loc['111']=['zzz',34,56]

final.head()

       NAME  ENGLISH  MATHS
406  gandhi       30     45
407     ram       40     34
408    sita       50     45
411   sagar       35     50
111     zzz       34     56

In [13]:
final.values[2]=['naga usha sri',50,45]
final

       NAME  ENGLISH  MATHS
406  gandhi       30     45
407     ram       40     34
408    sita       50     45
411   sagar       35     50
111     zzz       34     56

In [14]:
final=final.drop('111')
final

       NAME  ENGLISH  MATHS
406  gandhi       30     45
407     ram       40     34
408    sita       50     45
411   sagar       35     50

In [15]:


final.columns.tolist() #      display the columns names in a list


final.columns

Index(['NAME', 'ENGLISH', 'MATHS'], dtype='object')

In [16]:


final.describe()#    it analyze the entire data

         ENGLISH      MATHS
count   4.000000   4.000000
mean   38.750000  43.500000
std     8.539126   6.757712
min    30.000000  34.000000
25%    33.750000  42.250000
50%    37.500000  45.000000
75%    42.500000  46.250000
max    50.000000  50.000000

In [17]:


final.max() # it displays the maximum of each columns

NAME       sita
ENGLISH      50
MATHS        50
dtype: object

In [18]:


final

       NAME  ENGLISH  MATHS
406  gandhi       30     45
407     ram       40     34
408    sita       50     45
411   sagar       35     50

In [19]:
final['MATHS']

406    45
407    34
408    45
411    50
Name: MATHS, dtype: int64

In [20]:

# for a particular column
final['MATHS'].max()

50

In [21]:
final['MATHS'].min()

34

In [22]:
# to find mean of a particular column
final['MATHS'].mean()

43.5

In [25]:
income=pd.read_csv('income.csv')
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [26]:
income.values

array([['04000US01', 'Alabama', 37150, 37952, 42212, 44476, 39980, 40933,
        42590, 43464, 41381],
       ['04000US02', 'Alaska', 55891, 56418, 62993, 63989, 61604, 57848,
        57431, 63648, 61137],
       ['04000US04', 'Arizona', 45245, 46657, 47215, 46914, 45739, 46896,
        48621, 47044, 50602],
       ['04000US05', 'Arkansas', 36658, 37057, 40795, 39586, 36538,
        38587, 41302, 39018, 39919],
       ['04000US06', 'California', 51755, 55319, 55734, 57014, 56134,
        54283, 53367, 57020, 57528]], dtype=object)

In [27]:
income.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [28]:
income.values[1,1] , income.values[1][1]

('Alaska', 'Alaska')

In [29]:
print(income.columns[1],':',income.columns[-1])
for i in income.values:
    print(i[1],':',i[-1])

State : 2013
Alabama : 41381
Alaska : 61137
Arizona : 50602
Arkansas : 39919
California : 57528

In [30]:
s=0
for i in range(2,11):
    s+=income.values[2,i]
s

424933

In [2]:
import pandas as pd
i={'s1':10,'s2':20}
i=pd.Series(i)
i

s1    10
s2    20
dtype: int64

In [7]:
f={"Internal1":i}
f=pd.DataFrame(f)
f

    Internal1
s1         10
s2         20

In [12]:
f.loc['s3']=[10]
f

    Internal1
s1         10
s2         20
s3         10